import React from 'react'
import './preface.css'


export default function Preface() {
    return (
        <section className="container_info">
            <div className="titledivider"></div>
            <h2 className="infoTitle">Preface</h2>
            <div className='info'>

            <p className ='pf'>
                    เว็บไซต์ Portfolio นี้ ผมได้จัดทำขึ้นเพื่อเป็นการแสดงเนื้อหาของ ความรู้ ทักษะ ความสามารถต่างๆ รวมทั้งชิ้นงานหรือโครงงาน project ที่สำคัญ ที่เกี่ยวกับวิศวกรรมคอมพิวเตอร์
                    ทางด้าน software ให้เป็นไปตามคุณสมบัติในการสมัครงาน รวมทั้งประวัติส่วนตัว ทัศนคติ และประวัติการศึกษา เพื่อประกอบการตัดสินใจของบริษัทในการรับสมัครงานต่อไป 
                    <br></br>
                    <br></br>
                    อนึ่ง เว็บไซต์ portfolio นี้ ผมได้ใช้เทคนิคพิเศษในการพัฒนา โดยใช้ ReactJS มาใช้ในการพัฒนาเป็นหลัก และมีการใช้ HTML, CSS, Javascript มาใช้ในการจัดเรียงเนื้อหา 
                    และตกแต่งอื่นๆ ทำให้ portfolio นี้ เกิดความน่าสนใจและพิเศษมากขึ้น จนมาเป็น e-portfolio ในที่สุด 
                    <br></br>
                    <br></br>
                    ผมหวังเป็นอย่างยิ่งว่า ทางบริษัทจะได้รับการพิจารณาจากคณะกรรมการการสมัครงานในครั้งนี้ และให้ความสนใจแก่เว็บไซต์ portfolio ที่ผมได้จัดทำขึ้น และหากมีข้อผิดพลาดประการใดผมต้องขออภัยมา ณ ที่นี้ด้วยครับ
                    <br></br>
                    <br></br>
                    ขอแสดงความนับถือ
                    <br></br>
                    <br></br>
                    ธรรมนูญ กิจเลิศไพโรจน์
            </p>
            
        </div>
        </section>
        
    )
}
