import React from 'react'
import './preface.css'

export default function Preface() {
    return (
        <div className='info'>
            <hr size="5" width="100%" color="blueviolet"></hr>
            <br></br>
            <br></br>
            <span className="infoTitle">Preface</span>
            <br></br>
            <p className ='pf'>
                    เว็บไซต์ portfolio นี้ ผมได้จัดทำขึ้นเพื่อเป็นการแสดงเนื้อหาของ ความรู้ ทักษะ (sklills) ความสามารถต่างๆ รวมทั้งงานหรือโครงงาน project ที่สำคัญ ที่เกี่ยวกับวิศวกรรมคอมพิวเตอร์
                    ทางด้าน software ให้เป็นไปตามคุณสมบัติในการเข้าฝึกงาน รวมทั้งประวัติส่วนตัว ทัศนคติ และประวัติการศึกษา เพื่อประกอบการตัดสินใจของบริษัท ในการรับสมัครฝึกงานต่อไป 
                    <br></br>
                    <br></br>
                    อนึ่ง เว็บไซต์ portfolio นี้ ผมได้ใช้เทคนิคพิเศษในการพัฒนา โดยใช้ ReactJS stack มาใช้ในการพัฒนาเป็นหลัก และมีการใช้ HTML, CSS, Javascript มาใช้ในการจัดเรียงเนื้อหา 
                    และตกแต่งอื่นๆ ทำให้ portfolio นี้ เกิดความน่าสนใจและพิเศษมากขึ้น จนเป็น e-portfolio 
                    <br></br>
                    <br></br>
                    ผมหวังเป็นอย่างยิ่งว่า จะได้รับการพิจารณาจากคณะกรรมการการสมัครฝึกงานในครั้งนี้ และให้ความสนใจแก่เว็บไซต์ portfolio ที่ผมได้จัดทำขึ้น และหากมีข้อผิดพลาดประการใดผมต้องขออภัยมา ณ ที่นี้ด้วยครับ
                    <br></br>
                    <br></br>
                    ขอแสดงความนับถือ
                    <br></br>
                    <br></br>
                    ธรรมนูญ กิจเลิศไพโรจน์
            </p>
            
        </div>
    )
}
