import React from 'react'
import './vision.css'

export default function Vision() {
    return (
        <div className='info'>
            <hr size="5" width="100%" color="blueviolet"></hr>
            <br></br>
            <br></br>
            <span className="infoTitle">Attitude</span>
            <br></br>
            <p className ='pf'>
                    การพัฒนาเว็บไซต์หรือ software ทางด้าน frontend นั้น เป็นความสนใจของผมตั้งแต่ตอนเรียนและทำงานกลุ่มของวิชาต่างๆ หลังจากที่ผมได้ศึกษาการออกแบบและการพัฒนาเว็บไซต์หรือ 
                    software ต่างๆ ก็พบว่า frontend จะเป็นเรื่องเกี่ยวกับระบบที่ผู้ใช้สามารถเห็นได้ ทั้งเรื่องการทำงาน กราฟฟิกต่างๆ การออกแบบเว็บไซต์ และหน้าตาของเว็บไซต์ ทำให้ผมรู้ตัวเองว่า
                    ผมชื่นชอบทาง frontend มากขึ้น และได้พัฒนาทักษะ ฝีมือ ในงานกลุ่ม project ต่างๆ เพื่อให้เกิด website หรือ software ขึ้นมา และเพิ่มประสบการณ์ทางด้าน frontend ให้มากขึ้น  
                    <br></br>
                    <br></br>
                    ในเมื่อตัวผมเอง มีทักษะในเรื่องการพัฒนา website ในส่วนของ frontend แล้ว ผมก็รู้ว่าทักษะของงานยังมีอยู่อีกมาก ผมจึงมีแนวคิดที่อยากฝึกฝนและเก็บประสบการณ์เพิ่มเติมจากงานด้าน frontend อีกด้วยครับ
                    <br></br>
                    <br></br>
                    ในช่วงเดือน มิถุนายน 2565 - กรกฎาคม 2565 จะมีการฝึกงานภาคฤดูร้อนขึ้นเป็นเวลา 2 เดือน ผมจึงมีความประสงค์ที่อยากฝึกงานที่ดีและตรงตามความสนใจของผมเอง ได้เจอประสบการณ์ในการทำงานใหม่ๆ
                    ได้ทดสอบความสามารถและความถนัดของผมเอง และจะเป็นสายงานในการทำงานและประกอบอาชีพของผมได้ในอนาคตที่ดีอีกด้วยครับ
                    <br></br>
                    <br></br>
                    ธรรมนูญ กิจเลิศไพโรจน์
            </p>
            
        </div>
    )
}
